# GetAttachedColumns Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetAttachedColumns Method
ExporterIFCUtils Class See Also
---
Obtains a list of columns known to Revit as intersecting with this wall.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IList<FamilyInstance> GetAttachedColumns(
	Wall pWallElem
)
```

Visual Basic
---
```text
Public Shared Function GetAttachedColumns ( _
	pWallElem As Wall _
) As IList(Of FamilyInstance)
```

Visual C++
---
```text
public:
static IList<FamilyInstance^>^ GetAttachedColumns(
	Wall^ pWallElem
)
```

# ### Parameters
pWallElem
    Type: Autodesk.Revit.DB..::..Wall The wall.
# ### Return Value
The columns found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace